Revit 2027 API
PolyLine.GetTransformed Method
Gets the copy of the polyline which is applied the specified transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PolyLine GetTransformed(
	Transform transform
)
Public Function GetTransformed (
	transform As Transform
) As PolyLine
public:
PolyLine^ GetTransformed(
	Transform^ transform
)
member GetTransformed :
        transform : Transform -> PolyLine
Parameters
transform Transform
Return Value
PolyLine
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the transform is null.
See Also
Reference
PolyLine Class
Autodesk.Revit.DB Namespace